{
  "theme_specific": {
    "cinematic_noir": {
      "Character": ["Private Eye", "Silent Dancer", "Street Hustler", "Jazz Singer", "Detective"],
      "Setting": ["Foggy Alley", "Neon Bar", "Rain-Slicked Street", "Motel Room", "Rooftop Edge"],
      "Clue_Moment": ["Whispered Name", "Dropped Lighter", "Glint of Steel", "Phone Off Hook", "Final Glance"]
    },
    "romantic_dreamlike": {
      "Persona": ["Stargazer", "Writer", "Painter", "Lover", "Stranger"],
      "Scene": ["Flower Field", "Rainy Window", "Sunset Dock", "Old Café", "Paris Balcony"],
      "Emotion": ["Hopeful Longing", "Gentle Ache", "Fleeting Joy", "Blooming Warmth", "Timeless Yearning"]
    },
    "moody_introspective": {
      "Figure": ["Drifter", "Old Soul", "Outsider", "Thinker", "Watcher"],
      "Space": ["Empty Lot", "Dusty Library", "Forest Path", "Overpass", "Cracked Sidewalk"],
      "Mood": ["Disconnection", "Quiet Melancholy", "Fading Light", "Bitter Calm", "Still Reflection"]
    },
    "retro_nostalgic": {
      "Icon": ["Milkman", "Mod Girl", "Greaser", "Film Star", "War Bride"],
      "Era_Location": ["1950s Suburb", "60s Diner", "Drive-In", "Red Carpet", "Train Station"],
      "Item_Trigger": ["Tin Lunchbox", "Roller Skates", "Jukebox Tune", "Pocket Camera", "Love Letter"]
    },
    "gritty_real": {
      "Human_Detail": ["Torn Hoodie", "Bruised Knuckles", "Tight Grip", "Cracked Smile", "Bent Posture"],
      "Urban_Texture": ["Brick Wall", "Chain-Link Fence", "Scuffed Concrete", "Rusted Sign", "Flickering Lamp"],
      "Incident": ["Bike Crash", "Missed Shot", "Siren Echo", "Lost Wallet", "Screamed Name"]
    }
  },
  "gestalt_meta": {
    "visual_layout": [
      "Grided Symmetry",
      "Leading Lines",
      "Layered Depth",
      "Negative Space",
      "Rule of Thirds",
      "Center-Focused",
      "Off-Balance Tilt",
      "Vignette Framing"
    ],
    "contrast_light": [
      "High Contrast / Hard Shadows",
      "Soft Pastel Glow",
      "Low-Key Darkness",
      "Blown Highlights",
      "Monochrome Muted",
      "Split Lighting",
      "Color Gel Pop",
      "Even Natural Light"
    ],
    "portrait_landscape_types": [
      "Portrait – Tight Crop",
      "Portrait – Environmental",
      "Portrait – Silhouetted Backlight",
      "Landscape – Wide Open Space",
      "Landscape – Vertical Vista",
      "Landscape – Abstract Terrain",
      "Street – Snapshot in Motion",
      "Street – Framed Reaction"
    ],
    "historical_periods": [
      "Victorian London",
      "1920s Jazz Age",
      "1940s Wartime",
      "1960s Revolution",
      "1980s Suburbia",
      "Ancient Rome",
      "Post-War Berlin",
      "Future Dystopia (Neo-Tokyo)"
    ],
    "artistic_genres": [
      "Impressionist Blur",
      "Film Noir Shadowplay",
      "Expressionist Color",
      "Surrealist Dreamscape",
      "Pop Art Block Tone",
      "Baroque Drama",
      "Minimalist Isolation",
      "Modernist Displacement"
    ]
  },
  "vignettes": {
    "cinematic_noir": {
      "Private Eye|Motel Room|Dropped Lighter": "The lighter clinked on tile, still warm. He didn't need the matchbook clue—it was her scent on the pillow that burned. The motel room whispered old lies with fresh breath. Cigarette smoke hung like a question mark. Outside, the case kept unfolding, but she'd already rewritten the ending.",
      "Detective|Foggy Alley|Glint of Steel": "The fog twisted around her ankles as she moved deeper into the alley. A distant flash—metal catching light. She froze, hand on her holster. Twenty years on the force taught her that steel in darkness rarely offered second chances.",
      "Private Eye|Neon Bar|Whispered Name": "Blue neon painted his face as she leaned in. Her lips barely moved—just enough to form the name that changed everything. The bar's din swallowed her whisper whole, but he'd caught it. Already his mind was reshuffling the case like a crooked dealer. That name. It connected dots he'd been blind to for weeks.",
      "Private Eye|Rain-Slicked Street|Final Glance": "Rain pounded the pavement like a judge's gavel. She turned—just once—her silhouette haloed by distant headlights. That look said everything his paycheck couldn't buy. Wipers kept time with his pulse as her taxi splashed into darkness. This wasn't an ending. In his line of work, there were only pauses between troubles.",
      "Silent Dancer|Rooftop Edge|Phone Off Hook": "She balanced on the ledge, twelve stories of nothing beneath her slippers. City lights made her shadow long. Behind her, the phone dangled off-hook, the caller's threats still echoing. They wanted her testimony. She answered with this silent performance instead—toes pointed, back straight, arms extended. The perfect form for her final bow.",
      "Street Hustler|Foggy Alley|Whispered Name": "Fog crawled between garbage cans, thick enough to chew. The hustler pressed against brick, coin-flip poised between nimble fingers. \"Maroni,\" came the whisper from nowhere. The name hung in the mist. Not a customer. Not a cop. Someone who knew his real game—and for whom he'd been waiting three cold hours to appear.",
      "Jazz Singer|Neon Bar|Final Glance": "Her last note faded as smoke coiled around empty glasses. One spotlight, one sequined dress catching blue neon through haze. The piano player nodded goodnight, but she lingered. Across the room, their eyes met—the man with the silver briefcase. Her final glance told him when and where. Tomorrow, she wouldn't be singing anymore.",
      "Detective|Motel Room|Phone Off Hook": "The motel door swung open to stale air and cheap cologne. Room 8, just like the message said. She drew her gun before hitting the light switch. Empty. Bed untouched. Only the phone hung off its cradle, softly humming. She pressed it to her ear and heard breathing—then the click of a hammer being pulled back somewhere close by."
    },
    "romantic_dreamlike": {
      "Painter|Sunset Dock|Fleeting Joy": "She painted until the sun dipped low, each brushstroke pulling memories from the water's edge. He never returned, but the glow on the dock held his shape. The canvas dried with her smile—thin, unfinished. The joy, like light, touched everything briefly before fading into evening.",
      "Painter|Paris Balcony|Gentle Ache": "Morning light spilled across unfinished canvases. She hadn't captured it right—the precise blue of that evening they shared wine above the Seine. Each attempt darkened with longing. Pigment couldn't hold memory; it slipped through brush bristles like time through fingers. The ache of almost—almost perfect, almost love—seeped into every color she mixed.",
      "Stargazer|Flower Field|Timeless Yearning": "Stars burned white against midnight blue, mirrored by wildflowers swaying at her feet. Two infinities, above and below. She reached both arms upward as if to gather the cosmos. How many nights had she counted constellations, mapping celestial bodies while her own remained earthbound? Petals brushed her ankles—ephemeral touches from a universe that felt everything she yearned for.",
      "Writer|Rainy Window|Hopeful Longing": "Words failed him tonight, cursor blinking accusingly. Instead, he pressed his palm against cool glass, watching raindrops race each other down the pane. Each water trail—a story potential, a path chosen. Each drop—a character merging with others, gaining momentum. Somewhere in the storm was the person he'd written all his life without meeting. Not yet. But tonight felt pregnant with possibility.",
      "Lover|Old Café|Blooming Warmth": "Their hands met over chipped porcelain, coffee long grown cold. First date jitters had dissolved into something richer—familiar yet thrillingly strange. Afternoon light caught dust motes dancing above the table like wishes made visible. Neither spoke; they didn't need to. The warmth blooming between their interlaced fingers said everything necessary about futures tentatively unfurling.",
      "Stranger|Flower Field|Gentle Ache": "Their paths crossed among nodding poppies—two silhouettes backlit by summer haze. No names exchanged, just glances, an almost-smile. Recognition without memory. The field stretched endless between them, yet felt too narrow to contain what passed unspoken. They continued in opposite directions, carrying the gentle weight of what might have been—ships perfectly aligned, choosing different horizons."
    },
    "retro_nostalgic": {
      "War Bride|Train Station|Love Letter": "She stood where he'd promised, the letter folded tight in her glove. Steam curled around her heels as the train departed again—empty. Each year, same place. She wasn't waiting for him anymore, not really. Only for the sound of wheels and the echo of paper words.",
      "Milkman|1950s Suburb|Tin Lunchbox": "Dawn broke over identical rooftops as his truck hummed down Sycamore Lane. Bottles clinked gentle rhythm against metal carrier. At number 42, he found it—a child's Superman lunchbox, payment tucked inside with a crayon note: \"Thank you for the extra chocolate milk.\" Some mornings, this job felt like delivering little happinesses. He left two chocolates today instead of the usual one.",
      "Mod Girl|60s Diner|Jukebox Tune": "Her miniskirt swayed in perfect time as the Wurlitzer spilled Dusty Springfield across checkerboard tiles. Cherry-red boots and matching headband—she was a pop art dream come to life. College boys paused mid-burger, watching her drop a dime for another play. She knew better than to waste wishes on stars; she saved them for B-7 on jukeboxes, where dreams had a three-minute guarantee.",
      "Greaser|Drive-In|Pocket Camera": "Leather jacket creaking, he reached inside for the Kodak his old man had given him. The screen flickered giants across her face as she watched, transfixed by celluloid cowboys. This night deserved saving—her blonde ponytail caught in his car's window, popcorn between them, monsters from another world above. *Click*. Tomorrow he'd drop the film at Woolworth's. By Friday, this moment would be real enough to hold.",
      "Film Star|Red Carpet|Roller Skates": "Flashbulbs popped constellation-bright when she appeared—not in heels, but cherry-red roller skates gliding across crimson. The studio heads nearly fainted. The press went wild. But she remembered barnstorming small towns before Hollywood found her, skating down Main Streets as locals clapped. Fame was just another performance, but the joy of eight wheels beneath her—that was authentic as celluloid could never capture."
    },
    "moody_introspective": {
      "Drifter|Forest Path|Fading Light": "He walked paths that never stayed the same. Each fork led deeper into the hush of trees, dusk dimming all directions. The light thinned like old film reels, catching on branches, slipping through. He never looked back; the forest, like his past, never gave him the option.",
      "Drifter|Empty Lot|Disconnection": "Weeds pushed through cracked concrete—nature's slow rebellion. He sat on cinder blocks where a foundation once promised something permanent. Cities changed faster than people. Or maybe they both erased themselves at the same pace. A plastic bag cartwheeled past, caught briefly on his boot before wind claimed it again. He felt kinship with it—touching down briefly, belonging nowhere, tethered to nothing.",
      "Old Soul|Dusty Library|Still Reflection": "Sunbeams caught dust notes drifting between shelves. She ran fingers along leather spines older than her grandparents, feeling history's pulse beneath gilt lettering. Strangers had opened these same covers, carried these same words inside them afterward. Reading wasn't escape but connection across time—the still point where all who had ever considered these pages converged. She was never less alone than surrounded by these silent sentinels.",
      "Outsider|Overpass|Quiet Melancholy": "Cars streamed beneath, headlights threading concrete veins. From above, they seemed part of something coherent—a system, a purpose. People going somewhere definite. He dangled legs over the edge, watching but separate. The city hummed without noticing his absence from its rhythm. Melancholy wrapped around him like the graffiti-marked barriers—not painful exactly, just the persistent awareness of existing adjacent to belonging.",
      "Thinker|Cracked Sidewalk|Bitter Calm": "A dandelion had conquered the sidewalk's deepest fissure, yellow defiance against gray certainty. She paused her walk to consider it—nature's quiet insistence. How many feet had stepped over this crack, never noticing the revolution below? The calm that settled in her was bitter as dandelion stems. Understanding changed nothing; the city would still pour concrete, the plant would still push through, and she would still be the only one who stopped to notice.",
      "Watcher|Dusty Library|Fading Light": "From behind biography shelves, he observed the afternoon's slow dissolution. Others gathered belongings as closing time approached—students rubbing tired eyes, retirees marking pages, librarians checking watches. Only he remained unmoved, cataloging habits and patterns. The fading light transformed windows to mirrors, reflecting his silhouette among the stacks. For a moment, he saw himself as just another character in this daily story—present but peripheral, watching but watched."
    },
    "gritty_real": {
      "Torn Hoodie|Brick Wall|Siren Echo": "He sprinted past the mural, shoes hitting pavement like a drumline. Sirens tangled with city echoes, bouncing between alleys and broken bricks. His hoodie flapped, threadbare and real. Behind him, names were being shouted. Ahead, a single alley light flickered, no promise of safety—just another turn in the grid.",
      "Torn Hoodie|Chain-Link Fence|Screamed Name": "Metal diamonds bit into his palms as he hauled himself up. Below, his name tore through night air—his government name, not his tag. Bad sign. The fence swayed under his weight, cheap rust sprinkling like cinnamon. His hoodie caught—a moment of panic—before fabric surrendered with a sick rip. He dropped to concrete on the other side, already running. Tomorrow he'd need a new jacket, but tonight he just needed distance.",
      "Bruised Knuckles|Rusted Sign|Bike Crash": "The delivery bike crumpled against the STOP sign he'd run a thousand times before. Tonight's extra speed, extra rain—the calculus of accident. He pushed himself up from asphalt, blood mixing with puddle water. Knuckles already purple from yesterday's fight now scraped raw. Chinese takeout scattered across the intersection like offerings to uncaring gods. No traffic. No witnesses. Just him, the bent wheel, and another missed deadline to explain.",
      "Tight Grip|Scuffed Concrete|Lost Wallet": "Pat-down panic—back pocket empty. He spun around, eyes scanning the basketball court's worn surface. Three hours of pickup games, sweat-soaked trash talk, and now this. The wallet wasn't about the money—twelve dollars wouldn't matter. But the ID would. Replacing it meant questions, fees he couldn't afford, a system designed to make simple things hard. His fist clenched around the basketball, knuckles whitening. One last desperate scan before facing what losing meant.",
      "Cracked Smile|Flickering Lamp|Missed Shot": "The lamp sputtered above the garage hoop, casting uneven light across faded free-throw lines. His last shot rimmed out—the game-winner that wasn't. Instead of walking away defeated, he cracked that sideways smile that made his opponents more nervous than any scowl. \"Run it back,\" he said, collecting the ball from weeds. No one argued. His lip might be split from last week's altercation, but his confidence remained unbroken. Next shot always mattered more than the last.",
      "Bent Posture|Chain-Link Fence|Bike Crash": "The kid's bike lay twisted against chain-link, front wheel still spinning uselessly. He shuffled over, shoulders curved from decades of looking down at sidewalks instead of ahead at horizons. The crash had happened quick—he'd seen it from the bus stop bench that doubled as his afternoon office. The boy scrambled up, more embarrassed than hurt. \"You okay, man?\" he asked, voice gravel-rough from disuse. Some days, noticing was all he had left to offer the world."
    }
  },
  "story_triplets": [
    {
      "metaphor": "Star Network",
      "triplet": ["The Painter", "Sunset Dock", "Fleeting Joy"]
    },
    {
      "metaphor": "Ring Network",
      "triplet": ["War Bride", "Train Station", "Love Letter"]
    },
    {
      "metaphor": "Tree Network",
      "triplet": ["Drifter", "Forest Path", "Fading Light"]
    },
    {
      "metaphor": "Mesh Network",
      "triplet": ["Torn Hoodie", "Brick Wall", "Siren Echo"]
    },
    {
      "metaphor": "Hub-and-Spoke",
      "triplet": ["Private Eye", "Motel Room", "Dropped Lighter"]
    }
  ]
}